Revit 2024 API
BuiltInFailures.RebarFailures.RebarHookOverEndTreatment Property
 Cannot set hook at an end that has end treatment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RebarHookOverEndTreatment { get; }
Visual Basic
Public Shared ReadOnly Property RebarHookOverEndTreatment As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RebarHookOverEndTreatment {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace